# St7SetSolverLoadCaseTemperatureDependence

Sets the load case used to specify the temperature dependence for the analysis.

long St7SetSolverLoadCaseTemperatureDependence(long uID, long CaseNum)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Load case number or 0 for none.

Applicability

Applicable to linear static, load influence, natural frequency and linear transient dynamic analysis.